//
//  NewsContentViewController.swift
//  TinkoffNews
//
//  Created by Alexander on 18/06/2017.
//  Copyright © 2017 Alexander Terekhov. All rights reserved.
//

import UIKit

class NewsContentViewController: UIViewController {
    
    @IBOutlet var newsContent: UIWebView!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        newsContent.loadHTMLString("<p>Москва, Россия&nbsp;&mdash; 22&nbsp;мая 2017&nbsp;г. <br>\n\tТинькофф Банк объявляет о&nbsp;запуске Android Pay. С&nbsp;23&nbsp;мая клиенты Тинькофф Банка смогут оплачивать покупки прямо со&nbsp;своих мобильных устройств на&nbsp;операционной системе Android.</p>\n\n<p>С&nbsp;помощью Android Pay можно оплачивать покупки в&nbsp;магазинах, приложениях и&nbsp;<nobr>интернет-магазинах</nobr>.</p>\n\n<p>Пали Бхат, <nobr>вице-президент</nobr> по&nbsp;управлению продуктами Google, прокомментировал: &laquo;Мы&nbsp;рады, что с&nbsp;помощью Android Pay клиенты Тинькофф Банка получат возможность оплачивать покупки просто и&nbsp;безопасно. С&nbsp;завтрашнего дня устройство Android можно использовать для платежей по&nbsp;всей России. Число магазинов и&nbsp;приложений, где доступна наша технология, растет каждый день&raquo;.</p>\n\n<p>Анатолий Макешин, заместитель председателя правления, директор платежных систем Тинькофф Банка, прокомментировал: &laquo;Тинькофф Банк запускает Android Pay сразу для двух платежных систем&nbsp;&mdash; Mastercard и&nbsp;Visa. Благодаря Android Pay наши клиенты, владельцы устройств на&nbsp;операционной системе Android, смогут совершать покупки в&nbsp;одно касание. При этом они <nobr>по-прежнему</nobr> смогут получать бонусы за&nbsp;все покупки по&nbsp;карте и&nbsp;пользоваться другими преимуществами карт Тинькофф Банка&raquo;.</p>\n\n<p>Чтобы начать оплачивать покупки с&nbsp;мобильных устройств Android, необходимо установить приложение Android Pay из&nbsp;Google Play. Далее необходимо зарегистрироваться в&nbsp;Android Pay через приложение и&nbsp;добавить платежную карту. Клиенты Тинькофф Банка также смогут добавить карту через мобильный банк Тинькофф.</p>\n\n<p>Для оплаты покупок с&nbsp;помощью Android Pay в&nbsp;магазинах достаточно разблокировать телефон и&nbsp;приложить его к&nbsp;бесконтактному терминалу. Количество точек продаж в&nbsp;России, где доступны бесконтактные платежи, постоянно растет, ожидается, что к&nbsp;2020 году эта технология будет доступна в&nbsp;каждом терминале.</p>\n\n<p>Для оплаты покупок в&nbsp;приложениях и&nbsp;<nobr>интернет-магазинах</nobr> достаточно выбрать в&nbsp;качестве способа оплаты Android Pay.</p>\n\n<p>Расплачиваться с&nbsp;помощью Android Pay можно устройствами с&nbsp;операционной системой Android 4.4&nbsp;&mdash; KitKat и&nbsp;выше. Для оплаты бесконтактным способом в&nbsp;магазинах необходимо, чтобы устройство было оснащено <nobr>NFC-чипом</nobr>.</p>\n\n<p>Android Pay не&nbsp;хранит и&nbsp;никуда не&nbsp;передает номер платежной карты, поэтому платежи с&nbsp;помощью Android Pay безопасны.</p>", baseURL: nil)
    }
}
